{"keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"config": {"name": "Generator_Input", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "use_bias": false, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 64], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 12544}, "class_name": "Dense"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": [1], "trainable": true, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"threshold": 0.0, "name": "re_lu", "max_value": null, "negative_slope": 0.0, "dtype": "float32", "trainable": true}, "class_name": "ReLU"}, {"config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [7, 7, 256]}, "class_name": "Reshape"}, {"config": {"name": "Generator_1", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 128, "use_bias": false, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "output_padding": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5]}, "class_name": "Conv2DTranspose"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": [3], "trainable": true, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "gamma_constraint": null, "dtype": "float32", "name": "batch_normalization_1", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"threshold": 0.0, "name": "re_lu_1", "max_value": null, "negative_slope": 0.0, "dtype": "float32", "trainable": true}, "class_name": "ReLU"}, {"config": {"name": "Generator_2", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 1, "use_bias": false, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "output_padding": null, "data_format": "channels_last", "kernel_constraint": null, "activation": "tanh", "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [4, 4]}, "class_name": "Conv2DTranspose"}]}, "backend": "tensorflow", "class_name": "Sequential"}