{"keras_version": "2.2.4-tf", "config": {"name": "sequential_2", "layers": [{"config": {"name": "Inverter_Input", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 64, "use_bias": true, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"name": "Inverter_1", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 128, "use_bias": true, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"name": "Inverter_2", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "filters": 256, "use_bias": true, "strides": [2, 2], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "bias_constraint": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}, "class_name": "LeakyReLU"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"name": "Inverter_3", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512}, "class_name": "Dense"}, {"config": {"name": "Inverter_4", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "linear", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}